% exercise 2.3

clear; clc; close all;

x=[0 2 3 4];        % 초기값 설정
y=[7 11 28 63];     

x_p=0:0.1:4;        % 그래프를 위한 x

syms xx             % 함수를 위한 변수 설정

l0(xx)=(xx-x(2))*(xx-x(3))*(xx-x(4))/((x(1)-x(2))*(x(1)-x(3))*(x(1)-x(4)));     % l0 구하기
l1(xx)=(xx-x(1))*(xx-x(3))*(xx-x(4))/((x(2)-x(1))*(x(2)-x(3))*(x(2)-x(4)));     % l1 구하기
l2(xx)=(xx-x(1))*(xx-x(2))*(xx-x(4))/((x(3)-x(1))*(x(3)-x(2))*(x(3)-x(4)));     % l2 구하기
l3(xx)=(xx-x(1))*(xx-x(2))*(xx-x(3))/((x(4)-x(1))*(x(4)-x(2))*(x(4)-x(3)));     % l3 구하기

p(xx)=l0(xx)*y(1)+l1(xx)*y(2)+l2(xx)*y(3)+l3(xx)*y(4);      % 보간 다항식
p(xx)=simplify(p(xx))       % 보간 다항식 정리 해주는 함수
plot(x_p,p(x_p))            % 보간 다항식 그리기
hold on
plot(x,p(x),'o')            % 실제 값도 같이 그려서 비교








